tap "dart-lang/dart"
tap "farion1231/ccswitch"
tap "homebrew/services"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Double-entry accounting tool that works on plain text files
brew "beancount"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way of working with Protocol Buffers
brew "buf"
# Emacs dependency management
brew "cask"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Dynamic, general-purpose programming language
brew "clojure"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Modern, maintained replacement for ls
brew "eza"
# Web interface for the double-entry bookkeeping software Beancount
brew "fava"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli", link: false
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Java-based scripting language
brew "groovy"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd", restart_service: :changed
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# Library to communicate with iOS devices natively
brew "libimobiledevice", args: ["HEAD"]
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# Load testing and performance measurement application
brew "jmeter"
# Statically typed programming language for the JVM
brew "kotlin"
# Kubernetes command-line interface
brew "kubernetes-cli", link: false
# Build tool for Clojure
brew "leiningen"
# Java-based project management
brew "maven"
# Deep clean and optimize your Mac
brew "mole"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# General-purpose scripting language
brew "php"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Modern replacement for ps written in Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# JVM-based programming language
brew "scala"
# Cross-shell prompt for astronauts
brew "starship"
# Tools for market analysis
brew "ta-lib"
# User interface to the TELNET protocol
brew "telnet"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Implementation of Java Servlet and JavaServer Pages
brew "tomcat"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# SDK
brew "dart-lang/dart/dart"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Snippet management app
cask "lepton"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Replacement for Docker Desktop
cask "orbstack"
# App to switch hosts
cask "switchhosts"
cask "switchkey"
vscode "adamsome.vscode-theme-gruvbox-minor"
vscode "alexisvt.flutter-snippets"
vscode "alibaba-cloud.tongyi-lingma"
vscode "aniket-engg.sol-profiler-vscode"
vscode "antfu.icons-carbon"
vscode "anthropic.claude-code"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "drblury.protobuf-vsc"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "erlang-ls.erlang-ls"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "fisheva.eva-theme"
vscode "folke.vscode-monorepo-workspace"
vscode "formulahendry.code-runner"
vscode "gerrnperl.outline-map"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "haskell.haskell"
vscode "heron.firefox-devtools-theme"
vscode "interactive-smartlog.interactive-smartlog"
vscode "iolitelabs.solidity-macos"
vscode "jakebecker.elixir-ls"
vscode "jock.svg"
vscode "juanblanco.solidity"
vscode "justusadam.language-haskell"
vscode "kilocode.kilo-code"
vscode "kirigaya.openmcp"
vscode "liuchao.go-struct-tag"
vscode "marp-team.marp-vscode"
vscode "marscode.marscode-extension"
vscode "mateocerquetella.xcode-12-theme"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "nomicfoundation.hardhat-solidity"
vscode "octref.vetur"
vscode "ohanedan.lowlight-go-errors"
vscode "oracle.mysql-shell-for-vs-code"
vscode "panicbit.cargo"
vscode "ppz.ppz"
vscode "rebornix.nova"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rooveterinaryinc.roo-cline"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "scala-lang.scala"
vscode "simonsiefke.svg-preview"
vscode "smulyono.reveal"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "tds.taptap-vscode-theme"
vscode "teabyii.ayu"
vscode "tencent-cloud.coding-copilot"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "ucl.haskelly"
vscode "uloco.theme-bluloco-light"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "wicked-labs.wvsc-serendipity"
vscode "yatki.vscode-surround"
vscode "yzane.markdown-pdf"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillstruct"
go "github.com/ramya-rao-a/go-outline"
go "github.com/acroca/go-symbols"
go "github.com/mdempsky/gocode"
go "github.com/stamblerre/gocode"
go "github.com/godoctor/godoctor"
go "github.com/zmb3/gogetdoc"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/lint/golint"
go "github.com/fatih/gomodifytags"
go "github.com/uudashr/gopkgs/v2/cmd/gopkgs"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "golang.org/x/tools/cmd/gorename"
go "github.com/cweill/gotests/gotests"
go "golang.org/x/tools/cmd/guru"
go "github.com/josharian/impl"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "avm"
cargo "cargo-edit"
cargo "cargo-expand"
uv "ruff"
uv "specify-cli"
