tap "bufbuild/buf"
tap "davsanchez/gib"
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "kdash-rs/kdash"
tap "tinygo-org/tools"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way of working with Protocol Buffers
brew "buf"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Build tool for Clojure
brew "leiningen"
# Next-gen compiler infrastructure
brew "llvm"
# Run a Kubernetes cluster locally
brew "minikube"
# Modern replacement for ps written by Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# JVM-based programming language
brew "scala"
# Tools for market analysis
brew "ta-lib"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# .gitignore bootstrapper for projects that use git
brew "davsanchez/gib/gib"
# TinyGo is a Go compiler for small places. Microcontrollers, WebAssembly, and command-line tools. Based on LLVM.
brew "tinygo-org/tools/tinygo"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Translation application for text, pictures, and manual input
cask "bob"
cask "switchkey"