tap "bufbuild/buf"
tap "davsanchez/gib"
tap "ethereum/ethereum"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "kdash-rs/kdash"
tap "tinygo-org/tools"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way of working with Protocol Buffers
brew "buf"
# Dynamic, general-purpose programming language
brew "clojure"
# Cross-platform make
brew "cmake"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Official Go implementation of the Ethereum protocol
brew "ethereum"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Infamous electronic fortune-cookie generator
brew "fortune"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Build tool for Clojure
brew "leiningen"
# Next-gen compiler infrastructure
brew "llvm"
# Run a Kubernetes cluster locally
brew "minikube"
# Modern replacement for ps written by Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# JVM-based programming language
brew "scala"
# Tools for market analysis
brew "ta-lib"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Internet file retriever
brew "wget"
# .gitignore bootstrapper for projects that use git
brew "davsanchez/gib/gib"
# TinyGo is a Go compiler for small places. Microcontrollers, WebAssembly, and command-line tools. Based on LLVM.
brew "tinygo-org/tools/tinygo"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Translation application for text, pictures, and manual input
cask "bob"
cask "switchkey"
vscode "alexisvt.flutter-snippets"
vscode "Aniket-Engg.sol-profiler-vscode"
vscode "antfu.icons-carbon"
vscode "betterthantomorrow.calva"
vscode "betterthantomorrow.calva-spritz"
vscode "bmewburn.vscode-intelephense-client"
vscode "codezombiech.gitignore"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "erlang-ls.erlang-ls"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "folke.vscode-monorepo-workspace"
vscode "formulahendry.code-runner"
vscode "Gerrnperl.outline-map"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "Hamza-Aziane.obsidian-dark"
vscode "IoliteLabs.solidity-macos"
vscode "JakeBecker.elixir-ls"
vscode "jebbs.plantuml"
vscode "JuanBlanco.solidity"
vscode "LeetCode.vscode-leetcode"
vscode "Lencerf.beancount"
vscode "marp-team.marp-vscode"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.min-theme"
vscode "mjmcloug.vscode-elixir"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "NomicFoundation.hardhat-solidity"
vscode "octref.vetur"
vscode "panicbit.cargo"
vscode "PKief.material-icon-theme"
vscode "ppz.ppz"
vscode "redhat.vscode-yaml"
vscode "RemixProject.ethereum-remix"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "scala-lang.scala"
vscode "serayuzgur.crates"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "TabNine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "TDS.taptap-vscode-theme"
vscode "teabyii.ayu"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "trufflesuite-csi.truffle-vscode"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WakaTime.vscode-wakatime"
vscode "yatki.vscode-surround"
vscode "yzane.markdown-pdf"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
